InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПримененияЕНВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПримененияЕНВД</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РозничнаяТорговляОблагаетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПримененияПатенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПримененияПатенты</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РозничнаяТорговляОблагаетсяПатентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Патент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЭкспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
					<Comment>Автоматизированная УСН</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпециальныеНалоговыеРежимы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СпециальныеНалоговыеРежимы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПрименяется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПоложениеРеквизитаНаФорме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ПоложениеРеквизитаНаФорме</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВШапке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКомитенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупТоваровКомиссионером</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупленныеКомиссионеромТовары</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/НалогиУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НастройкиНУДляФормыДокумента(пФорма, пСтруктураДопДанныхДляВозврата = Неопределено) Экспорт
	
	Если пСтруктураДопДанныхДляВозврата = Неопределено Тогда
		пСтруктураДопДанныхДляВозврата = Новый Структура;
	КонецЕсли;
	
	Элементы = пФорма.Элементы;
	Объект = пФорма.Объект;
	
	СтруктураВозврата = Новый Структура();
	
	Если пСтруктураДопДанныхДляВозврата.Свойство("ВозвращатьТипСтруктурнойЕдиницы")
		И пСтруктураДопДанныхДляВозврата.Свойство("СтруктурнаяЕдиница") Тогда
		ТипСтруктурнойЕдиницы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(пСтруктураДопДанныхДляВозврата.СтруктурнаяЕдиница, "ТипСтруктурнойЕдиницы");
		СтруктураВозврата.Вставить("ТипСтруктурнойЕдиницы", ТипСтруктурнойЕдиницы);
	КонецЕсли;
	
	ВидимостьГруппыУчетВНУДоИзменения = Элементы.ГруппаУчетВНУ.Видимость;
	НоваяВидимостьГруппыУчетВНУДоИзменения = ВидимостьГруппыУчетВНУДоИзменения;
	
	Если РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		НоваяВидимостьГруппыУчетВНУДоИзменения = Ложь;
		
		СтруктураВозврата.Вставить("НоваяВидимостьГруппыУчетВНУДоИзменения", НоваяВидимостьГруппыУчетВНУДоИзменения);
		СтруктураВозврата.Вставить("ЭтоЮридическоеЛицо", Истина);
		СтруктураВозврата.Вставить("СистемаНалогообложенияСтруктура", Неопределено);
		Возврат СтруктураВозврата;
	Иначе
		НоваяВидимостьГруппыУчетВНУДоИзменения = Истина;
	КонецЕсли;
	
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.
	ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, Объект.Дата);
	
	Если Не СистемаНалогообложенияСтруктура.ПлательщикУСН Тогда
		НоваяВидимостьГруппыУчетВНУДоИзменения = Ложь;
	Иначе
		НоваяВидимостьГруппыУчетВНУДоИзменения = Истина;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("НоваяВидимостьГруппыУчетВНУДоИзменения", НоваяВидимостьГруппыУчетВНУДоИзменения);
	СтруктураВозврата.Вставить("ЭтоЮридическоеЛицо", Ложь);
	СтруктураВозврата.Вставить("СистемаНалогообложенияСтруктура", СистемаНалогообложенияСтруктура);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция определяет тип налогообложения продажи товара налогом на добавленную стоимость.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация, для которой определяется система налогообложения
//	Склад - СправочникСсылка.Склады - Розничный склад, для которой определяется система налогообложения
//	Дата - Дата - Дата определения системы налогообложения
//
// Возвращаемое значение:
// 	ПеречислениеСсылка.ТипыНалогообложенияНДС
Функция НалогообложениеНДС(Организация, Склад = Неопределено, Дата = '00010101') Экспорт

	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(Дата) Тогда
		Запрос.УстановитьПараметр("Дата", Дата);
	Иначе
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	КонецЕсли;

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС) КАК НалогообложениеНДС
	|ИЗ
	|	РегистрСведений.ПримененияЕНВД.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияЕНВД
	|ГДЕ
	|	ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|ИЗ
	|	РегистрСведений.ПримененияПатенты.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияПатенты
	|ГДЕ
	|	ПримененияПатенты.РозничнаяТорговляОблагаетсяПатентом
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	|ГДЕ
	|	Налогообложение.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
	|	И НЕ Налогообложение.ПлательщикНДСПрименяющийУСН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	|ГДЕ
	|	Налогообложение.СистемаНалогообложения В (ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.АУСН), ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок))";

	НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;

	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НалогообложениеНДС = Выборка.НалогообложениеНДС;
	КонецЕсли;

	Возврат НалогообложениеНДС;

КонецФункции

// Проверяет, является ли организация плательщиком НДС
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации
//  Дата		 - Дата
// 
// Возвращаемое значение:
//   - Булево
//
Функция ОрганизацияПлательщикНДС(Организация, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СистемыНалогообложения.Период КАК Дата,
	|	СистемыНалогообложения.СистемаНалогообложения КАК СистемаНалогообложения
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК СистемыНалогообложения
	|ГДЕ
	|	СистемыНалогообложения.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СистемыНалогообложения.Период,
	|	СистемыНалогообложения.СистемаНалогообложения
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК СистемыНалогообложения
	|ГДЕ
	|	СистемыНалогообложения.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
	|	И СистемыНалогообложения.ПлательщикНДСПрименяющийУСН";

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция определяет тип налогообложения продажи товара налогом на добавленную стоимость.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация, для которой определяется система налогообложения
//	Склад - СправочникСсылка.Склады - Розничный склад, для которой определяется система налогообложения
//	Дата - Дата - Дата определения системы налогообложения
//
// Возвращаемое значение:
// 	ПеречислениеСсылка.СпециальныеНалоговыеРежимы
Функция СпециальныйНалоговыйРежим(Организация, Склад = Неопределено, Дата = '00010101') Экспорт

	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(Дата) Тогда
		Запрос.УстановитьПараметр("Дата", Дата);
	Иначе
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	КонецЕсли;

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Налогообложение.ПрименяетсяПатент
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.ПСН)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.НеПрименяется)
	|	КОНЕЦ КАК НалоговыйРежим
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	|ГДЕ
	|	Налогообложение.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.ПСН)
	|ИЗ
	|	РегистрСведений.ПримененияПатенты.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияПатенты
	|ГДЕ
	|	ПримененияПатенты.РозничнаяТорговляОблагаетсяПатентом";

	НалоговыйРежим = Перечисления.СпециальныеНалоговыеРежимы.НеПрименяется;

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НалоговыйРежим = Выборка.НалоговыйРежим;
	КонецЕсли;

	Возврат НалоговыйРежим;

КонецФункции

// Определяет патент по складу
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Склад - СправочникСсылка.СтруктурныеЕдиницы
//  Дата - Дата
//
// Возвращаемое значение:
// 	СправочникСсылка.Патенты
Функция ПатентПоСкладу(Организация, Склад, Дата) Экспорт

	Патент = Справочники.Патенты.ПустаяСсылка();
    ДатаДействия = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПримененияПатентыСрезПоследних.Патент КАК Патент
	|ИЗ
	|	РегистрСведений.ПримененияПатенты.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &Склад
	|				И РозничнаяТорговляОблагаетсяПатентом) КАК ПримененияПатентыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Патенты КАК Патенты
	|		ПО ПримененияПатентыСрезПоследних.Патент = Патенты.Ссылка
	|			И (Патенты.ДатаНачала <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ))
	|			И (Патенты.ДатаОкончания >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ))";
	Запрос.УстановитьПараметр("Дата", ДатаДействия);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Патент;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Патент = Выборка.Патент;
	КонецЕсли;

	Возврат Патент;

КонецФункции

// Функция возвращает текст запроса, который получает данные для функции "ПатентПоУмолчаниюДляДенежныхДокументов".
Функция ТекстЗапросаПоПатентамДляЗаполненияНаОснованииРасходнойНаклданой() Экспорт
	
	ТекстЗапроса =
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"
	+
	"ВЫБРАТЬ
	|	Патенты.Ссылка КАК Патент
	|ИЗ
	|	Справочник.Патенты КАК Патенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО Патенты.Владелец = РасходнаяНакладная.Организация
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|	И РасходнаяНакладная.СпециальныйНалоговыйРежим = ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.ПСН)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПримененияПатентыСрезПервых.Патент КАК Патент
	|ИЗ
	|	РегистрСведений.ПримененияПатенты.СрезПервых(&Дата, ) КАК ПримененияПатентыСрезПервых
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО ПримененияПатентыСрезПервых.Организация = РасходнаяНакладная.Организация
	|			И ПримененияПатентыСрезПервых.СтруктурнаяЕдиница = РасходнаяНакладная.СтруктурнаяЕдиница
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|	И РасходнаяНакладная.СпециальныйНалоговыйРежим = ЗНАЧЕНИЕ(Перечисление.СпециальныеНалоговыеРежимы.ПСН)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает патент по умолчанию для склада или организации, если для склада патент не задан или склад не выбран.
Функция ПатентПоУмолчаниюДляДенежныхДокументов(пПатентыОрганизации, пПатентыПоСкладам) Экспорт
	
	Патент = Справочники.Патенты.ПустаяСсылка();
	Если пПатентыОрганизации.Количество() = 1 Тогда
		Патент = пПатентыОрганизации[0].Патент;
	ИначеЕсли пПатентыПоСкладам.Количество() = 1 Тогда
		Патент = пПатентыПоСкладам[0].Патент;
	КонецЕсли;
	
	Возврат Патент;
	
КонецФункции

// Функция определяет настройки системы налогообложения организации
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации
//  Дата		 - Дата
// 
// Возвращаемое значение:
//   - Структура:
//		* ЕстьУСН - Булево - в организации используется упрощенная система налогообложения
//		* ЕстьПатент - Булево - организация использует патент
//		* ПатентПоУмолчанию - СправочникСсылка.Патенты
//		* СпецРежим - ПеречислениеСсылка.СпециальныеНалоговыеРежимы
//
Функция ОпределитьНастройкиНалоговогоУчета(Организация, Дата) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьУСН", Ложь);
	Результат.Вставить("ЕстьПатент", Ложь);
	Результат.Вставить("ПатентПоУмолчанию", Справочники.Патенты.ПустаяСсылка());
	Результат.Вставить("СпецРежим", Перечисления.СпециальныеНалоговыеРежимы.НеПрименяется);
	
	Если НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Организация) Тогда
	
		Налогообложение =
			РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Организация, Дата);

		Результат.ЕстьУСН = Налогообложение.ПлательщикУСН;
		Результат.ЕстьПатент = Налогообложение.ПрименяетсяПатент;
		Если Результат.ЕстьПатент Тогда
			Результат.ПатентПоУмолчанию = Справочники.Патенты.ПолучитьПатентПоУмолчанию(Организация, Дата);
		КонецЕсли;
		
		Если Налогообложение.ПрименяетсяПатент
			И Налогообложение.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ОсобыйПорядок Тогда
			
			Результат.СпецРежим = Перечисления.СпециальныеНалоговыеРежимы.ПСН;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Функция - Налогообложение по основанию
//
// Параметры:
//  Организация				 - СправочникСсылка.Организации
//  Дата					 - Дата
//  Основание				 - ДокументСсылка	 - документ - основание платежа
//  НастройкиНалоговогоУчета - Структура	 	 - см. НалогиУНФ.ОпределитьНастройкиНалоговогоУчета
// 
// Возвращаемое значение:
//   - Структура
//		* УчитыватьВНУ - Булево - используется упрощенная система налогообложения
//		* ПСН - Булево - используется патентная система налогообложения
//		* Патент - СправочникСсылка.Патенты
//
Функция НалогообложениеПоОснованию(Организация, Дата, Основание, НастройкиНалоговогоУчета = Неопределено) Экспорт
	
	ДокументОснование = Неопределено;
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Если Основание.Свойство("Основание") Тогда
			ДокументОснование = Основание.Основание;
		КонецЕсли;
	Иначе
		ДокументОснование = Основание;
	КонецЕсли;
	
	Результат = Новый Структура("УчитыватьВНУ, ПСН, Патент", Ложь, Ложь, Справочники.Патенты.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НастройкиНалоговогоУчета = Неопределено Тогда
		НастройкиНУ = НалогиУНФ.ОпределитьНастройкиНалоговогоУчета(Организация, Дата);
	Иначе
		НастройкиНУ = НастройкиНалоговогоУчета;
	КонецЕсли;

	ОснованиеЭтоЗаказПокупателя = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя"));
	ОснованиеЭтоАктВыполненныхРабот = (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АктВыполненныхРабот"));
	
	ТипыДенежныхДокументов = Новый ОписаниеТипов("ДокументСсылка.РасходСоСчета,
												| ДокументСсылка.ПоступлениеНаСчет,
												| ДокументСсылка.РасходИзКассы,
												| ДокументСсылка.ПоступлениеВКассу");
	ОснованиеЭтоДенежныйДокумент = ТипыДенежныхДокументов.СодержитТип(ТипЗнч(ДокументОснование));
	
	РеквизитыНалогообложения = Новый Структура;
	РеквизитыНалогообложения.Вставить("УчитыватьВНУ");
	РеквизитыНалогообложения.Вставить("СпециальныйНалоговыйРежим");
	РеквизитыНалогообложения.Вставить("Патент");
	
	Если ОснованиеЭтоЗаказПокупателя Тогда
		СписокРеквизитов = "УчитыватьВНУ, СпециальныйНалоговыйРежим, Организация, СостояниеЗаказа";
	ИначеЕсли ОснованиеЭтоАктВыполненныхРабот Тогда
		СписокРеквизитов = "СпециальныйНалоговыйРежим, Патент";
	Иначе
		СписокРеквизитов = "";
		Для Каждого КлючРеквизит Из РеквизитыНалогообложения Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснование, КлючРеквизит.Ключ) Тогда
				СписокРеквизитов = СписокРеквизитов + ?(ПустаяСтрока(СписокРеквизитов), "", ",") + КлючРеквизит.Ключ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ЗначениеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, СписокРеквизитов, Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ЗначениеРеквизитов, РеквизитыНалогообложения, Ложь);
	Иначе
		ЗначениеРеквизитов = РеквизитыНалогообложения;
	КонецЕсли;
	
	ЗначениеРеквизитов.Вставить("РежимПСН",
		ЗначениеРеквизитов.СпециальныйНалоговыйРежим = Перечисления.СпециальныеНалоговыеРежимы.ПСН);
		
	Если ОснованиеЭтоАктВыполненныхРабот Тогда
		НалогообложениеОснования = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
				ДокументОснование.Организация, ДокументОснование.Дата);
		ЗначениеРеквизитов.УчитыватьВНУ = НалогообложениеОснования.ПлательщикУСН
			И ЗначениеРеквизитов.СпециальныйНалоговыйРежим <> Перечисления.СпециальныеНалоговыеРежимы.ПСН;
	КонецЕсли;

	Если ОснованиеЭтоЗаказПокупателя Тогда
		ОснованиеЭтоЗаказНаряд = (ТипЗнч(ЗначениеРеквизитов.СостояниеЗаказа) = Тип("СправочникСсылка.СостоянияЗаказНарядов"));
		Если НЕ ОснованиеЭтоЗаказНаряд Тогда
			ЗначениеРеквизитов.УчитыватьВНУ = НастройкиНУ.ЕстьУСН И НЕ (НастройкиНУ.ЕстьПатент И ЗначениеРеквизитов.РежимПСН);
		КонецЕсли;
	КонецЕсли;
	
	Если ОснованиеЭтоДенежныйДокумент
		И ФормыДокументовДеньгиКлиентСервер.ВидОперацииРасшифровкаСНалоговымУчетом(ДокументОснование.ВидОперации)
		И ДокументОснование.ПоложениеНастроекНалоговогоУчета = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти
		И ДокументОснование.РасшифровкаПлатежа.Количество() > 0 Тогда
		
		ЗначениеРеквизитов.УчитыватьВНУ = ДокументОснование.РасшифровкаПлатежа[0].УчитыватьВНУ;
		ЗначениеРеквизитов.Патент = ДокументОснование.РасшифровкаПлатежа[0].Патент;
	КонецЕсли;
	
	ПатентОснования = Справочники.Патенты.ПустаяСсылка();
	Если ЗначениеЗаполнено(ЗначениеРеквизитов.Патент) Тогда
		ПатентОснования = ЗначениеРеквизитов.Патент;
	КонецЕсли;
	
	Если НастройкиНУ.ЕстьПатент И (ЗначениеРеквизитов.РежимПСН ИЛИ НЕ НастройкиНУ.ЕстьУСН) Тогда
		Результат.УчитыватьВНУ = Ложь;
		Результат.ПСН = Истина;
		Если ЗначениеЗаполнено(ЗначениеРеквизитов.Патент) Тогда
			Результат.Патент = ЗначениеРеквизитов.Патент;
		Иначе
			Результат.Патент = НастройкиНУ.ПатентПоУмолчанию;
		КонецЕсли;
	Иначе
		Результат.УчитыватьВНУ = (НастройкиНУ.ЕстьУСН И ЗначениеРеквизитов.УчитыватьВНУ <> Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура заполняет значение реквизита НДС включен в стоимость в документе
//
// Параметры:
//  Документ - ДокументОбъект	 - Документ, в котором необходимо заполнить реквизит НДС включен в стоимость
//
Процедура ЗаполнитьНДСВключенВСтоимостьВДокументе(Документ) Экспорт
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "НДСВключатьВСтоимость") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("СебестоимостьБезНДС") Тогда
		
		Если ЗначениеЗаполнено(Документ.Организация) Тогда
			Документ.НДСВключатьВСтоимость = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация, "НДСВключатьВСтоимость");
		Иначе
			Документ.НДСВключатьВСтоимость = Истина;
		КонецЕсли;
		
	Иначе
		Документ.НДСВключатьВСтоимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Считывает текст из двоичных данных, используя поток в памяти.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - Двоичные данные текста.
//   Кодировка - КодировкаТекста - Кодировка текста.
//
// Возвращаемое значение:
//   Строка - Результат чтения текста из двоичных данных.
//
Функция ДвоичныеДанныеВСтроку(ДвоичныеДанные, Кодировка) Экспорт
	БуферДвоичныхДанных = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
	ПотокВПамяти = Новый ПотокВПамяти(БуферДвоичныхДанных);
	ЧтениеТекста = Новый ЧтениеТекста(ПотокВПамяти, Кодировка);
	Возврат ЧтениеТекста.Прочитать();
КонецФункции

// Загружает классификатор из веб-сервиса и возвращает его "Распакованные" данные.
//
// Параметры:
//   Идентификатор - Строка - Идентификатор классификатора в веб-сервисе.
//
// Возвращаемое значение:
//   Структура - Данные классификатора.
//
Функция ПолучитьДанныеКлассификатораИзСервиса(Идентификатор) Экспорт
	МодульРаботаСКлассификаторами = ОбщегоНазначения.ОбщийМодуль("РаботаСКлассификаторами");
	
	Идентификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Идентификатор);
	РезультатПолученияФайлов = МодульРаботаСКлассификаторами.ПолучитьФайлыКлассификаторов(Идентификаторы);
	
	Если РезультатПолученияФайлов.КодОшибки = "ОбновлениеНеТребуется" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Значение = Неопределено;
	Если Не ЗначениеЗаполнено(РезультатПолученияФайлов.КодОшибки)
		И ТипЗнч(РезультатПолученияФайлов.ДанныеКлассификаторов) = Тип("ТаблицаЗначений") Тогда
		СтрокаТаблицы = РезультатПолученияФайлов.ДанныеКлассификаторов.Найти(Идентификатор, "Идентификатор");
		Если СтрокаТаблицы <> Неопределено Тогда
			Попытка
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтрокаТаблицы.АдресФайла);
				ТекстXML = ДвоичныеДанныеВСтроку(ДвоичныеДанные, КодировкаТекста.UTF8);
				Значение = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстXML);
			Исключение
				Значение = Неопределено;
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				РезультатПолученияФайлов.КодОшибки = "ОшибкаИзвлеченияЗначенияИзФайла";
				РезультатПолученияФайлов.СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
				РезультатПолученияФайлов.ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Если Значение = Неопределено Тогда
		УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
		ТекстЖурнала = НСтр("ru = 'При получении классификатора %1 из веб-сервиса возникла ошибка:
			|Код: %2
			|Краткая информация: %3
			|Подробная информация:
			|%4'");
		ТекстЖурнала = СтрШаблон(ТекстЖурнала,
			Идентификатор,
			Строка(РезультатПолученияФайлов.КодОшибки),
			Строка(РезультатПолученияФайлов.СообщениеОбОшибке),
			Строка(РезультатПолученияФайлов.ИнформацияОбОшибке));
	Иначе
		УровеньЖурнала = УровеньЖурналаРегистрации.Информация;
		ТекстЖурнала = СтрШаблон(НСтр("ru = 'Файл классификатора %1 получен из веб-сервиса.'"), Идентификатор);
	КонецЕсли;
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Нормативно-правовая информация БЗК'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурнала,
		,
		,
		ТекстЖурнала);
	
	Возврат Значение;
КонецФункции

// Определяет, нужно ли определять настройки НДС по реквизиту Организация документа
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект
// 
// Возвращаемое значение:
//   - Булево - Истина, если настройки НДС нужно определять по реквизиту Организация
//
Функция ОпределятьНалогиПоОрганизации(ДокументОбъект) Экспорт
	
	ДокументыОрганизация = Новый Массив;
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.АктОРасхожденияхПолученный"));
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.ОтчетКомитенту"));
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.ОтчетОПереработке"));
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"));
	ДокументыОрганизация.Добавить(Тип("ДокументСсылка.СчетНаОплату"));
	
	Если ДокументыОрганизация.Найти(ТипЗнч(ДокументОбъект.Ссылка)) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВидОперации = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ВидОперации") Тогда
		ВидОперации = ДокументОбъект.ВидОперации;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю
        ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветХранение
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВыкупТоваровКомиссионером
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВыкупленныеКомиссионеромТовары Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции
	
// Определяет, нужно ли определять настройки НДС по реквизитам Организация и СтруктурнаяЕдиница (склад)
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект
// 
// Возвращаемое значение:
//   - Булево - Истина, если настройки НДС нужно определять по реквизиту Организация и СтруктурнаяЕдиница (склад)
//
Функция ОпределятьНалогиПоОрганизацииСкладу(ДокументОбъект) Экспорт
	ДокументыОрганизацияСклад = Новый Массив;
	ДокументыОрганизацияСклад.Добавить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
	ДокументыОрганизацияСклад.Добавить(Тип("ДокументСсылка.ЧекККМ"));
	ДокументыОрганизацияСклад.Добавить(Тип("ДокументСсылка.ЧекККМВозврат"));
	
	Если ДокументыОрганизацияСклад.Найти(ТипЗнч(ДокументОбъект.Ссылка)) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

// Создает структуру с настройками НДС по умолчанию
// 
// Возвращаемое значение:
//   - Структура
//		* ТипНалогообложения - ПеречислениеСсылка.ТипыНалогообложенияНДС - тип налогообложения
//		* ВидСтавкиНДС - ПеречислениеСсылка.ВидыСтавокНДС, Неопределено
//
Функция НастройкиНДСПустые() Экспорт
	
	НастройкиНДС = Новый Структура;
	НастройкиНДС.Вставить("ТипНалогообложения", Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
	НастройкиНДС.Вставить("ВидСтавкиНДС");
	
	Возврат НастройкиНДС;
КонецФункции

// Создает структуру с настройками НДС по данным организации и склада.
// Учитываются данные системы налогообложения организации, действующие на переданную дату.
//	
//
// Параметры:
//	Организация - СправочникСсылка.Организации
//	Склад		- СправочникСсылка.СтруктурныеЕдиницы, Неопределено
//	Дата		- Дата
//
// Возвращаемое значение - см. НастройкиНДСПустые
//
Функция НастройкиНДСОрганизации(Организация = Неопределено, Склад = Неопределено, Дата = '00010101') Экспорт

	НастройкиНДС = НастройкиНДСПустые();	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат НастройкиНДС;
	КонецЕсли;
	
	Период = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());

	ПакетыЗапросов = Новый Массив;
	ПакетыЗапросов.Добавить(Справочники.СтавкиНДС.ПолучитьТекстЗапросаСозданияВТСтавкиНДС(Период));
	
	ТекстЗапроса = 	"ВЫБРАТЬ
	               	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС) КАК НалогообложениеНДС,
	               	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС) КАК ВидСтавкиНДС,
	               	|	5 КАК Приоритет
	               	|ПОМЕСТИТЬ ВТНастройкиОрганизации
	               	|ИЗ
	               	|	РегистрСведений.ПримененияЕНВД.СрезПоследних(
	               	|			&Дата,
	               	|			Организация = &Организация
	               	|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияЕНВД
	               	|ГДЕ
	               	|	ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД
	               	|
	               	|ОБЪЕДИНИТЬ ВСЕ
	               	|
	               	|ВЫБРАТЬ
	               	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС),
	               	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС),
	               	|	15
	               	|ИЗ
	               	|	РегистрСведений.ПримененияПатенты.СрезПоследних(
	               	|			&Дата,
	               	|			Организация = &Организация
	               	|				И СтруктурнаяЕдиница = &Склад) КАК ПримененияПатенты
	               	|ГДЕ
	               	|	ПримененияПатенты.РозничнаяТорговляОблагаетсяПатентом
	               	|
	               	|ОБЪЕДИНИТЬ ВСЕ
	               	|
	               	|ВЫБРАТЬ
	               	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС),
	               	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС),
	               	|	5
	               	|ИЗ
	               	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	               	|ГДЕ
	               	|	Налогообложение.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
	               	|	И НЕ Налогообложение.ПлательщикНДСПрименяющийУСН
	               	|
	               	|ОБЪЕДИНИТЬ ВСЕ
	               	|
	               	|ВЫБРАТЬ
	               	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС),
	               	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС),
	               	|	5
	               	|ИЗ
	               	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	               	|ГДЕ
	               	|	Налогообложение.СистемаНалогообложения В (ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.АУСН), ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок))
	               	|
	               	|ОБЪЕДИНИТЬ ВСЕ
	               	|
	               	|ВЫБРАТЬ
	               	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС),
	               	|	НастройкиУчетаНДССрезПоследних.СтавкаНалогообложенияПриУСН,
	               	|	10
	               	|ИЗ
	               	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК СистемыНалогообложенияОрганизацийСрезПоследних
	               	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&Дата, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних
	               	|		ПО СистемыНалогообложенияОрганизацийСрезПоследних.Организация = НастройкиУчетаНДССрезПоследних.Организация
	               	|			И (СистемыНалогообложенияОрганизацийСрезПоследних.ПлательщикНДСПрименяющийУСН)
	               	|
	               	|ОБЪЕДИНИТЬ ВСЕ
	               	|
	               	|ВЫБРАТЬ ПЕРВЫЕ 1
	               	|	ВЫБОР
	               	|		КОГДА Организации.ВидСтавкиНДСПоУмолчанию = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	               	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	               	|		КОГДА Организации.ВидСтавкиНДСПоУмолчанию = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	               	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НаЭкспорт)
	               	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС)
	               	|	КОНЕЦ,
	               	|	Организации.ВидСтавкиНДСПоУмолчанию,
	               	|	0
	               	|ИЗ
	               	|	Справочник.Организации КАК Организации
	               	|ГДЕ
	               	|	Организации.Ссылка = &Организация
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ ПЕРВЫЕ 1
	               	|	ВТНастройкиОрганизации.НалогообложениеНДС КАК НалогообложениеНДС,
	               	|	ВТНастройкиОрганизации.ВидСтавкиНДС КАК ВидСтавкиНДС,
	               	|	ВТНастройкиОрганизации.Приоритет КАК Приоритет,
	               	|	ЕСТЬNULL(ВТСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)) КАК СтавкаНДС
	               	|ИЗ
	               	|	ВТНастройкиОрганизации КАК ВТНастройкиОрганизации
	               	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиНДС КАК ВТСтавкиНДС
	               	|		ПО ВТНастройкиОрганизации.ВидСтавкиНДС = ВТСтавкиНДС.ВидСтавкиНДС
	               	|
	               	|УПОРЯДОЧИТЬ ПО
	               	|	Приоритет УБЫВ";
    ПакетыЗапросов.Добавить(ТекстЗапроса);
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Период);
	Запрос.Текст = СтрСоединить(ПакетыЗапросов, Символы.ПС);
	
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НастройкиНДС.ТипНалогообложения = Выборка.НалогообложениеНДС;
		НастройкиНДС.ВидСтавкиНДС = Выборка.ВидСтавкиНДС;
	КонецЕсли;

	Возврат НастройкиНДС;
	
КонецФункции

// Создает структуру с настройками НДС на основании Способа заполнения ставки НДС в договоре
//
// Параметры:
//	СпособЗаполненияСтавкиНДС - ПеречислениеСсылка.СпособыЗаполненияСтавкиНДС
//	Дата		- Дата
//	Организация - СправочникСсылка.Организации - организация для получения ставки НДС, если ее невозможно определить по способу заполнения
//
// Возвращаемое значение - см. НастройкиНДСПустые
//
Функция НастройкиНДССпособаЗаполнения(СпособЗаполненияСтавкиНДС, Дата = '00010101', Организация = Неопределено) Экспорт

	НастройкиНДС = НастройкиНДСПустые();
	
	СтавкаОбщаяУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ОбщаяУСН");
	СтавкаПониженнаяУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ПониженнаяУСН"); 
	СтавкаБезНДС = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.БезНДС");
	
	Если ЗначениеЗаполнено(СпособЗаполненияСтавкиНДС) Тогда
		Если СпособЗаполненияСтавкиНДС = ПредопределенноеЗначение("Перечисление.СпособыЗаполненияСтавкиНДС.БезНДС") Тогда
			НастройкиНДС.ВидСтавкиНДС = СтавкаБезНДС;
		ИначеЕсли СпособЗаполненияСтавкиНДС = ПредопределенноеЗначение("Перечисление.СпособыЗаполненияСтавкиНДС.ОбщаяУСН") Тогда
			НастройкиНДС.ВидСтавкиНДС = СтавкаОбщаяУСН;
		ИначеЕсли СпособЗаполненияСтавкиНДС = ПредопределенноеЗначение("Перечисление.СпособыЗаполненияСтавкиНДС.ПониженнаяУСН") Тогда
			НастройкиНДС.ВидСтавкиНДС = СтавкаПониженнаяУСН;
		Иначе
			НастройкиНДС.ВидСтавкиНДС = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Общая");
		КонецЕсли;
		
		Если (НастройкиНДС.ВидСтавкиНДС = СтавкаОбщаяУСН ИЛИ НастройкиНДС.ВидСтавкиНДС = СтавкаПониженнаяУСН) Тогда
			
			Если ЗначениеЗаполнено(Дата) Тогда
				ДатаПрименения = Дата;
			Иначе
				ДатаПрименения = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Если НЕ РегламентированнаяОтчетностьУСНКлиентСервер.Применяется176ФЗ(ДатаПрименения) Тогда
				НастройкиНДС.ВидСтавкиНДС = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.БезНДС");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НастройкиНДС.ВидСтавкиНДС) И ЗначениеЗаполнено(Организация) Тогда
		НастройкиНДС.ВидСтавкиНДС = Организация.ВидСтавкиНДСПоУмолчанию;
	КонецЕсли;	
	
	Если НастройкиНДС.ВидСтавкиНДС = СтавкаБезНДС Тогда
		НастройкиНДС.ТипНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС");
	Иначе
		НастройкиНДС.ТипНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС");
	КонецЕсли;
	
	Возврат НастройкиНДС;
	
КонецФункции

// Определяет, есть ли в документе определенная ставка НДС на УСН
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка 
//  ВидСтавкиУСН	 - ПеречислениеСсылка.ВидыСтавокНДС
// 
// Возвращаемое значение:
//   - Булево - Истина, если в переданном документе используется указанная ставка НДС на УСН
//
Функция ДокументСоСтавкойУСН(ДокументСсылка, ВидСтавкиУСН) Экспорт

	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКомиссионера")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетПереработчика")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПлатежноеПоручение")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика")
	Тогда
		Возврат Документы[ДокументСсылка.Метаданные().Имя].НаличиеСтавкиУСН(ДокументСсылка, ВидСтавкиУСН);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
